In [84]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
from sklearn.metrics import accuracy_score

In [127]:
train_set = pd.read_csv(r'C:\Users\ACER-PC\Desktop\New folder\titanic\train.csv')

In [34]:
train_set.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [35]:
train_set.shape

(891, 12)

In [36]:
train_set.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [37]:
train_set['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [38]:
train_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [40]:
train_set.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [41]:
corr_matrix = train_set.corr()
corr_matrix
corr_matrix['Survived'].sort_values(ascending=False)

Survived       1.000000
Fare           0.257307
Parch          0.081629
PassengerId   -0.005007
SibSp         -0.035322
Age           -0.077221
Pclass        -0.338481
Name: Survived, dtype: float64

In [42]:
# Dropping columns which are not useful

In [43]:
#cols = ['Name', 'Ticket', 'Cabin']
#train_set = train_set.drop(cols , axis = 1)
df  = train_set.drop( ['Name','Ticket','Cabin'], axis=1)

In [45]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [46]:
#Dropping rows have missing value

In [47]:
df = df.dropna()

In [49]:
df.shape

(712, 9)

In [ ]:
#Dummy Variables

In [51]:
dummies=[]

cols = ['Pclass', 'Sex' ,'Embarked']

for i in cols:
    dummies.append(pd.get_dummies(df[i]))

In [54]:
Dummy = pd. concat(dummies, axis=1)

In [55]:
Dummy    #Pclass: 1,2,3   #Sex:female , male    #Embarked: C,Q,S

     1  2  3  female  male  C  Q  S
0    0  0  1       0     1  0  0  1
1    1  0  0       1     0  1  0  0
2    0  0  1       1     0  0  0  1
3    1  0  0       1     0  0  0  1
4    0  0  1       0     1  0  0  1
..  .. .. ..     ...   ... .. .. ..
885  0  0  1       1     0  0  1  0
886  0  1  0       0     1  0  0  1
887  1  0  0       1     0  0  0  1
889  1  0  0       0     1  1  0  0
890  0  0  1       0     1  0  1  0

[712 rows x 8 columns]

In [56]:
df = pd.concat((df , Dummy), axis=1)

In [57]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,1,2,3,female,male,C,Q,S
0,1,0,3,male,22.0,1,0,7.2500,S,0,0,1,0,1,0,0,1
1,2,1,1,female,38.0,1,0,71.2833,C,1,0,0,1,0,1,0,0
2,3,1,3,female,26.0,0,0,7.9250,S,0,0,1,1,0,0,0,1
3,4,1,1,female,35.0,1,0,53.1000,S,1,0,0,1,0,0,0,1
4,5,0,3,male,35.0,0,0,8.0500,S,0,0,1,0,1,0,0,1

In [58]:
df = df.drop(['Pclass', 'Sex', 'Embarked'], axis= 1)

In [59]:
df.head()

,PassengerId,Survived,Age,SibSp,Parch,Fare,1,2,3,female,male,C,Q,S
0,1,0,22.0,1,0,7.2500,0,0,1,0,1,0,0,1
1,2,1,38.0,1,0,71.2833,1,0,0,1,0,1,0,0
2,3,1,26.0,0,0,7.9250,0,0,1,1,0,0,0,1
3,4,1,35.0,1,0,53.1000,1,0,0,1,0,0,0,1
4,5,0,35.0,0,0,8.0500,0,0,1,0,1,0,0,1

In [60]:
#missing value

In [62]:
#interpolate() function that will replace all the missind value nans ro interpolated values.
df ['Age'] = df['Age'].interpolate()

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  712 non-null    int64
 1   Survived     712 non-null    int64
 2   Age          712 non-null    float64
 3   SibSp        712 non-null    int64
 4   Parch        712 non-null    int64
 5   Fare         712 non-null    float64
 6   1            712 non-null    uint8
 7   2            712 non-null    uint8
 8   3            712 non-null    uint8
 9   female       712 non-null    uint8
 10  male         712 non-null    uint8
 11  C            712 non-null    uint8
 12  Q            712 non-null    uint8
 13  S            712 non-null    uint8
dtypes: float64(2), int64(4), uint8(8)
memory usage: 44.5 KB

In [66]:
x = df.values
y = df['Survived'].values

In [67]:
#now drop Survived column in x
x = np.delete(x, 1 , axis =1)

In [ ]:
# divided dataset into train_set and test_set

In [68]:
from sklearn.model_selection import train_test_split

train_x , test_x , train_y , test_y = train_test_split(x , y , test_size=0.3 , random_state=44)

In [ ]:
#LogisticRegression

In [86]:
from sklearn.linear_model import LogisticRegression

classifier=LogisticRegression()
classifier.fit(train_x, train_y)

C:\Users\ACER-PC\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [87]:
pred_y = classifier.predict(test_x)

In [88]:
accuracy_score(test_y , pred_y)

0.780373831775701

In [89]:
#K nearest neighbor

In [124]:
from sklearn.neighbors import KNeighborsClassifier
classifier=KNeighborsClassifier(n_neighbors= 4)
classifier.fit(train_x, train_y)

KNeighborsClassifier(n_neighbors=4)

In [125]:
pred_y = classifier.predict(test_x)

In [126]:
accuracy_score(test_y , pred_y)

0.6495327102803738

In [93]:
#Decision Tree

In [100]:
from sklearn.tree import DecisionTreeClassifier

classifier= DecisionTreeClassifier()
classifier.fit(train_x, train_y)

DecisionTreeClassifier()

In [101]:
pred_y = classifier.predict(test_x)

In [102]:
accuracy_score(test_y , pred_y)

0.7523364485981309

In [78]:
# Rnadon forest

In [115]:
from sklearn.ensemble import RandomForestClassifier

classifier= RandomForestClassifier(n_estimators=100)
classifier.fit(train_x, train_y)

RandomForestClassifier()

In [116]:
pred_y = classifier.predict(test_x)

In [117]:
accuracy_score(test_y , pred_y)

0.8037383177570093